Autodesk.Revit.DB.TextNote.Width
Access the width of the TextNote object.
Remarks: With this method, the width of the TextNote object can be retrieved and changed.
The set method will calculate the real width of the TextNote. If the requested width is less than the real width,
the real width will be set instead of the requested width.

Autodesk.Revit.DB.TextNote.Coord
Access the position of the TextNote object.
Remarks: With this method, the position of the TextNote object can be retrieved and changed.

Autodesk.Revit.DB.TextNote.Leaders
Retrieves all the leaders belongs to the current TextNote object.
Remarks: This property is ReadOnly.

Autodesk.Revit.DB.TextNote.RemoveLeaders
Remove all the leaders for the current TextNote object.
Remarks: It is different to the method AddLeader, in which one Leader is added. Calling this method will remove all the leaders.

Autodesk.Revit.DB.TextNote.AddLeader(Autodesk.Revit.DB.TextNoteLeaderTypes)
Add a leader for the current TextNote object and return the new leader.
Remarks: If the current leader type is not same with the input type, Autodesk::Revit::Exceptions::InvalidOperationException will be thrown.

Autodesk.Revit.DB.TextNote
Provides access to the TextNote object in Autodesk Revit.
Remarks: The user can create TextNote object and change the internal property as Leaders and so on.